In [1]:
# pandas module 설치
!pip install pandas

Collecting pandas
  Downloading pandas-1.3.1-cp39-cp39-win_amd64.whl (10.4 MB)
Collecting pytz>=2017.3
  Downloading pytz-2021.1-py2.py3-none-any.whl (510 kB)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\developer\python39\lib\site-packages (from pandas) (2.8.2)
Collecting numpy>=1.17.3
  Downloading numpy-1.21.1-cp39-cp39-win_amd64.whl (14.0 MB)
Requirement already satisfied: six>=1.5 in c:\developer\python39\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.21.1 pandas-1.3.1 pytz-2021.1

WARNING: You are using pip version 21.1.3; however, version 21.2.1 is available.
You should consider upgrading via the 'c:\developer\python39\python.exe -m pip install --upgrade pip' command.

In [6]:
import pandas as pd
s = pd.Series([1, 9, -3, 4])
#print(s)

#print(s.values)
#print(s.index)
print(s.dtypes)

int64

In [7]:
s= pd.Series([1, 9, -3, 4], index=['a','b', 'c', 'd'])
print(s)

a    1
b    9
c   -3
d    4
dtype: int64

In [8]:
#사전과 호환
dic = {'A':3000, 'B': 6000, 'C':2000, 'D':4000}
s = pd.Series(dic)
print(s)

A    3000
B    6000
C    2000
D    4000
dtype: int64

In [16]:
# 인덱스 확인
# 행
print(df.index)
# 열
print(df.columns)

NameError: name 'df' is not defined

In [17]:
df['new'] = [1, 2, 3, 4, 5]
print(df)

NameError: name 'df' is not defined

In [18]:
del df['past']
print(df)

NameError: name 'df' is not defined

In [19]:
data = {'name' : ['A', 'B', 'C', 'D', 'E'],
       'Year' : [2017, 2018, 2019, 2020, 2021],
       'points' : [1, 2, 3, 4, 5]}
df = pd. DataFrame(data)
df.loc[5, :] = ['F', 2022, 6]
print(df)

  name    Year  points
0    A  2017.0     1.0
1    B  2018.0     2.0
2    C  2019.0     3.0
3    D  2020.0     4.0
4    E  2021.0     5.0
5    F  2022.0     6.0

In [20]:
print(df[2:4])

  name    Year  points
2    C  2019.0     3.0
3    D  2020.0     4.0

In [21]:
print(df.loc[1:3, 'name'])

1    B
2    C
3    D
Name: name, dtype: object

In [22]:
print(df.sum(axis=1))

0    2018.0
1    2020.0
2    2022.0
3    2024.0
4    2026.0
5    2028.0
dtype: float64

C:\Users\user3\AppData\Local\Temp/ipykernel_11536/166068483.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.sum(axis=1))

In [23]:
print(df.sum(axis=0))

name       ABCDEF
Year      12117.0
points       21.0
dtype: object

In [33]:
df = pd.read_csv("cities.csv")
print(df)

ParserError: Error tokenizing data. C error: Expected 1 fields in line 4, saw 2

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   Year    6 non-null      float64
 2   points  6 non-null      float64
dtypes: float64(2), object(1)
memory usage: 364.0+ bytes

In [31]:
행정구역, 총인구수(명), 남자인구수(명), 여자인구수(명)
서울특별시, 51672400, 4649442, 4916548
부산광역시, 9565990, 1647291, 1717067
대구광역시, 2397646, 1182380, 1215266
인천광역시, 2936367, 1470544,1465823
광주광역시, 1442647, 713793, 728854
대전광역시, 1456107, 726666, 729441
울산광역시, 1126369, 578924, 547445
세종특별자치시, 362995, 181328, 181667
경기도, 13500688, 6795088, 6705600
강원도, 1535530, 772949, 762581
충청북도, 1597503, 810225, 787278
충청남도, 2117400, 1082113, 1035287
전라북도, 1794345, 892670, 901675
전라남도, 1840921, 926398, 914523
경상북도, 2632401, 1326844, 1305557
경상남도, 3325840, 1674612, 1651228
제주특별자치도, 675293, 338766, 336527

NameError: name '행정구역' is not defined

In [32]:
df.describe()

              Year    points
count     6.000000  6.000000
mean   2019.500000  3.500000
std       1.870829  1.870829
min    2017.000000  1.000000
25%    2018.250000  2.250000
50%    2019.500000  3.500000
75%    2020.750000  4.750000
max    2022.000000  6.000000

In [34]:
#1. 타이타닉 데이터를 df형태로 읽어오기
#2. df 출력
#3. head(), tail(), info(), shape, describe

In [35]:
df = pd.read_csv("titanic.csv")
print(df)

     Unnamed: 0  Survived  Pclass     Sex        Age     Fare Embarked  \
0             0         0       3    male  22.000000   7.2500        S
1             1         1       1  female  38.000000  71.2833        C
2             2         1       3  female  26.000000   7.9250        S
3             3         1       1  female  35.000000  53.1000        S
4             4         0       3    male  35.000000   8.0500        S
..          ...       ...     ...     ...        ...      ...      ...
886         886         0       2    male  27.000000  13.0000        S
887         887         1       1  female  19.000000  30.0000        S
888         888         0       3  female  29.699118  23.4500        S
889         889         1       1    male  26.000000  30.0000        C
890         890         0       3    male  32.000000   7.7500        Q

      Class  Adult_Male   Embarktown
0     Third        True  Southampton
1     First       False    Cherbourg
2     Third       False  Southampton
3     First       False  Southampton
4     Third        True  Southampton
..      ...         ...          ...
886  Second        True  Southampton
887   First       False  Southampton
888   Third       False  Southampton
889   First        True    Cherbourg
890   Third        True   Queenstown

[891 rows x 10 columns]

In [36]:
df.head()

,Unnamed: 0,Survived,Pclass,Sex,Age,Fare,Embarked,Class,Adult_Male,Embarktown
0,0,0,3,male,22.0,7.2500,S,Third,True,Southampton
1,1,1,1,female,38.0,71.2833,C,First,False,Cherbourg
2,2,1,3,female,26.0,7.9250,S,Third,False,Southampton
3,3,1,1,female,35.0,53.1000,S,First,False,Southampton
4,4,0,3,male,35.0,8.0500,S,Third,True,Southampton

In [37]:
df.tail()

,Unnamed: 0,Survived,Pclass,Sex,Age,Fare,Embarked,Class,Adult_Male,Embarktown
886,886,0,2,male,27.000000,13.00,S,Second,True,Southampton
887,887,1,1,female,19.000000,30.00,S,First,False,Southampton
888,888,0,3,female,29.699118,23.45,S,Third,False,Southampton
889,889,1,1,male,26.000000,30.00,C,First,True,Cherbourg
890,890,0,3,male,32.000000,7.75,Q,Third,True,Queenstown

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  891 non-null    int64
 1   Survived    891 non-null    int64
 2   Pclass      891 non-null    int64
 3   Sex         891 non-null    object
 4   Age         891 non-null    float64
 5   Fare        891 non-null    float64
 6   Embarked    889 non-null    object
 7   Class       891 non-null    object
 8   Adult_Male  891 non-null    bool
 9   Embarktown  889 non-null    object
dtypes: bool(1), float64(2), int64(3), object(4)
memory usage: 63.6+ KB

In [41]:
df.shape

(891, 10)

In [44]:
df.describe()

       Unnamed: 0    Survived      Pclass         Age        Fare
count  891.000000  891.000000  891.000000  891.000000  891.000000
mean   445.000000    0.383838    2.308642   29.699118   32.204208
std    257.353842    0.486592    0.836071   13.002015   49.693429
min      0.000000    0.000000    1.000000    0.420000    0.000000
25%    222.500000    0.000000    2.000000   22.000000    7.910400
50%    445.000000    0.000000    3.000000   29.699118   14.454200
75%    667.500000    1.000000    3.000000   35.000000   31.000000
max    890.000000    1.000000    3.000000   80.000000  512.329200